Courses/7140/Lectures/Design/literate.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Literate Programming</title>
<!-- 2018-09-25 Tue 17:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Software Engineering Lecture"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../">../../</a> 2015-06-10
</div>
<div id="content">
<h1 class="title">Literate Programming</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Overview of Literate Programming</a></li>
<li><a href="#sec-2">2. Literate Programming #1</a>
<ul>
<li><a href="#sec-2-1">2.1. Literate Programming #2</a></li>
<li><a href="#sec-2-2">2.2. Literate Programming #3</a></li>
</ul>
</li>
<li><a href="#sec-3">3. LP Examples</a></li>
<li><a href="#sec-4">4. LP Tools</a>
<ul>
<li><a href="#sec-4-1">4.1. LP Tools #2</a></li>
<li><a href="#sec-4-2">4.2. LP Tools #3</a></li>
<li><a href="#sec-4-3">4.3. LP Tools #4</a></li>
</ul>
</li>
<li><a href="#sec-5">5. References</a></li>
<li><a href="#sec-6">6. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview of Literate Programming</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Combines a programming language with a <i>requ</i> spec/ design
documentation language
</li>

<li>Treat a program as a piece of literature, addressed to human beings
rather than to a computer.  The source code and the prose
documentation of the program is also viewed as a hypertext
document, rather like the World Wide Web. (Knuth used the word WEB
for this purpose long before CERN grabbed it!) 
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Literate Programming #1</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Primary task of the programmer: Explain the design and
implementation of a program to fellow humans.
</li>

<li>Secondary task: Produce a ready-to-build collection of source code
files.  
</li>

<li>An LP author presents it in an order that suits the explanation of
the program to fellow software engineers, not necessarily in the
order that a compiler may expect it.
</li>
</ol>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Literate Programming #2</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Original idea by Professor Emeritus Donald Knuth, Stanford U,
"fastest pen in the West", Turing Award Winner 1974, and the
developer of the <a href="http://en.wikipedia.org/wiki/TeX">TeX</a> typesetting system.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Literate Programming #3</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Donald E. Knuth, "Literate Programming", The Computer Journal,
1984, 27(2): 97-111.
</li>

<li><code>weave</code> Generate the .tex file(s) from .web file(s)
</li>

<li><code>tangle</code> Generate the source code file(s) from .web file(s)
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> LP Examples</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>The typesetting program TeX is designed as a literate program by Knuth.
</li>

<li><a href="http://www.tug.org/TUGboat/tb23-3-4/tb75saha.pdf">http://www.tug.org/TUGboat/tb23-3-4/tb75saha.pdf</a> Rambutan: Literate
Programming in Java, TUGboat, Volume 23 (2002), No. 3/4
</li>
<li>Knuth has several example programs at
<a href="http://www-cs-faculty.stanford.edu/~knuth/programs.html">http://www-cs-faculty.stanford.edu/~knuth/programs.html</a> to read.
His "Programming Pearls, Literate Programming: The Common Words
Problem", 1986, is a Required Reading.  See <a href="../Examples//Knuth-CWP">../Examples//Knuth-CWP</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> LP Tools</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>cweb by Knuth <a href="http://www-cs-faculty.stanford.edu/~uno/cweb.html">http://www-cs-faculty.stanford.edu/~uno/cweb.html</a> 
</li>
<li>noweb by Ramsey <a href="http://www.cs.tufts.edu/~nr/noweb/">http://www.cs.tufts.edu/~nr/noweb/</a>  supports multiple PL
</li>
</ol>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> LP Tools #2</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li><a href="http://wiki.eclipse.org/Intent">http://wiki.eclipse.org/Intent</a> "The Mylyn Intent prime objective is
to make developers consider documentation as something useful and
easy to maintain, that they can use to formalize their best
practices and share their knowledge. Based on a new vision of the
documentation, in which explanations in natural langage are formally
linked with technical artefacts (java code, models, manifest files,
bugzilla issues, git repositories, etc.), Intent allows you to
efficiently update documentation when a change occurs in your
software, turning it into a true Agile documentation."
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> LP Tools #3</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li><a href="http://lep.sourceforge.net/tutorials.htm">http://lep.sourceforge.net/tutorials.htm</a> Literate Eclipse
Programming assists developers in writing structured, well
documented source code. LEP integrates automated extraction of
source code and documentation into a familiar eclipse
environment. Compiling and debugging are fully supported.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> LP Tools #4</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li>More LP tools: <a href="http://www.cs.tufts.edu/~nr/noweb/">noweb</a>, <a href="http://nuweb.sourceforge.net/">nuweb</a>, <a href="https://code.google.com/p/nano-lp/">nano-lp</a>, &#x2026;; some of these are ready
to <code>apt-get install</code> packages in Debian/Ubuntu distros.  Visit
<a href="http://www.literateprogramming.com/">http://www.literateprogramming.com/</a> for further details.
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Donald E. Knuth, Literate Programming, (Stanford, California:
Center for the Study of Language and Information, 1992), xvi+368pp.
(CSLI Lecture Notes, no. 27.)  ISBN 0-937073-80-6.  This book is an
anthology of essays including Knuth's early papers on related
topics such as structured programming, as well as the article in
The Computer Journal that launched Literate Programming itself. The
articles have been revised, extended, and brought up to date.
<a href="http://www-cs-faculty.stanford.edu/~uno/lp.html">http://www-cs-faculty.stanford.edu/~uno/lp.html</a> Recommended Visit.
</li>

<li>Knuth, Donald E. "TEX: The Program", Volume B of Computers and
typesetting. (1986).  624 pages, Addison-Wesley Professional; The
typesetting program TeX described in literate programming.
ISBN-10: 0201134373.  One and only one review (as of 201x) on
Amazon.com: "This book is extremely valuable to those hoping to
understand and reuse Knuth's classic typesetting algorithms. It
contains every detail needed for the implementation. Each section
has a number associated with the source code. Besides, it can also
serve as an excellent example of a large project for computer
science students. One can understand better "the art of computer
programming" after reading this book. &#x2026;"  Recommended Reading ;-)
</li>

<li><a href="http://www.literateprogramming.com/">http://www.literateprogramming.com/</a> "Design Documentation"
Recommended Visits.
</li>

<li><a href="http://www.literateprogramming.com/knuthweb.pdf">http://www.literateprogramming.com/knuthweb.pdf</a> Computer Journal,
198x. Required Reading
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2015 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2015-06-10
</div>
</body>
</html>
